//1.小兔测试距离用记录参数表 
//2.当前小兔控制策略：收到底盘发送报文（包括柱子类型和距离）后匹配参数表中对应电机参数，加载到程序中进行动作
//3.文件思路：采用结构体数组，下标即为柱子类型代号，结构体内以结构体数组包含多个距离对应电机信息
//4.点位信息内容包括 (1)电机参数：发射电机转速，抬升仰角
//					 (2)测试用参数：hit_rate要用串口更改,便于查看距离有效程度。所有测试用参数最后都会删除
#include "parameter_table.h"

int column_type=0;
int test_distance=0;

#define basic_distance_1 500
#define basic_distance_2 500
#define basic_distance_3 500
#define basic_distance_4 500

//距离·速度·仰角·命中率
map_parameter column_infm[column_num] = {
	//       1号距离           |  2号距离           |  3号距离          |  4号距离            |  5号距离
	{{   {500,5000,81910,0},   {1000,100,1,0},   {1500,100,1,0},   {2000,100,1,0},   {2500,100,1,0} }},//1类柱
	{{   {600,12,10,0},   {1000,100,1,0},   {1500,100,1,0},   {2000,100,1,0},   {2500,100,1,0} }},//2类柱
	{{   {700,12,10,0},   {1000,100,1,0},   {1500,100,1,0},   {2000,100,1,0},   {2500,100,1,0} }},//3类柱
	{{   {800,12,10,0},   {1000,100,1,0},   {1500,100,1,0},   {2000,100,1,0},   {2500,100,1,0} }},//4类柱
};
